/*
Чеклин Павел ИУ7-32Б
Типы и структуры данных
Лабораторная работа 6 
Деревья и хэш-таблицы
Вариант 2 
В текстовом файле содержатся целые числа. Построить ДДП из чисел файла. Вывести его на экран в виде дерева. 
Сбалансировать полученное дерево и вывести его на экран. Построить хеш-таблицу из чисел файла. Использовать 
закрытое хеширование для устранения коллизий. Осуществить добавление введенного целого числа, если его там нет, 
в ДДП, в сбалансированное дерево, в хеш-таблицу и в файл. Сравнить время добавления, объем памяти и количество 
сравнений при использовании различных (4-х) структур данных. Если количество сравнений в хеш-таблице больше 
указанного (вводить), то произвести реструктуризацию таблицы, выбрав другую функцию.
*/
#include <stdio.h>

int main()
{
    puts("Main");
    return 0;
}
